Revit 2024 API
BuiltInFailures.IlluminationFailures Class
 Failures about Illumination.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class IlluminationFailures
Visual Basic
Public NotInheritable Class IlluminationFailures
Visual C++
public ref class IlluminationFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures
See Also
BuiltInFailures.IlluminationFailures Members
Autodesk.Revit.DB Namespace